from math import *

print("▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄")
print("▌                                                 ▐")
print("▌       Задача 1.1. Вариант 17                    ▐")
print("▌                                                 ▐")
print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")


print("Написать приведённую формулу по правилам языка программирования, для проверки использовать x=0.5")
print("Ответ: 2.36642")

# зададим переменные
check_res=2.36642
x = 0.5

# посчитаем результат
result=abs(7.2 - 10*x)/(x/9 + e**(2*x))**(1/3)
result= round(result * atan((4 * tan(2*x))/(sqrt(1.1*x**3))), 5)

print("результат: ", result)
print("правильный ответ: ", check_res)
