import numpy as np

print("▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄")
print("▌                                                 ▐")
print("▌       Задача 1.6. Вариант 17                    ▐")
print("▌                                                 ▐")
print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")

print('''
      Средняя продолжительность D жизни населения некоторой строны составляет N лет. Прогнозируется ее ежегодный рост на p% за счет улучшения медицинского обслуживания и уменьшение на Q месяцев ежегодно вследствие ухудшения экологии. Найти значение D по прошествии М лет, а также среднегодовое увеличение D за М лет
      ''')


def life_expec_cycle(N, p, Q, M):
    D = N
    q = Q / 12              
    r = 1 + p / 100         
    for _ in range(M):
        D = D * r - q
    return D

N, p, Q, M = 70, 1.5, 3, 10
D = life_expec_cycle(N, p, Q, M)
print(f"D через {M} лет: {D:.3f} лет")
print(f"Среднегодовое увеличение: {(D - N) / M:.4f} лет/год")

print(f" ")

def life_expec_formula(N, p, Q, M):
    q = Q / 12
    r = 1 + p / 100
    if abs(r - 1) < 1e-12:              # p ≈ 0
        return N - q * M
    return N * r**M - q * (r**M - 1) / (r - 1)

D = life_expec_formula(70, 1.5, 3, 10)
print(f"D через {M} лет: {D:.3f} лет")
print(f" ")

