import numpy as np

print("▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄")
print("▌                                                 ▐")
print("▌       Задача 1.3. Вариант 17                    ▐")
print("▌                                                 ▐")
print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")

print('''
      Составить программу для вычисления результата по формуле.
      Принять x=0.5; n=20;
      ''')

x = 0.5
n = 20
Sum = 0

for k in range(1, n) :
    Sum = ((np.exp(1.2 * k) - (k+1) / k) ** (1/k))/(n + np.log(np.sqrt(k*x)))

Sum = Sum * (1/7)*np.sqrt(x)

print(f"результат: {Sum}")



