from math import *

print("▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄")
print("▌                                                 ▐")
print("▌       Задача 1.3. Вариант 17                    ▐")
print("▌                                                 ▐")
print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")


print("Население некоторого района составляет М тыс.человек, а длина шоссейных дорог района - Н км. Существует прогноз, согласно которому население за год будет увеличиваться на p%. А длина шоссейных дорог на B км. ежегодно. Для каждого из последующих N лет найти, какая длина шоссейных дорог приходится на 1 тыс. жителей")

print("-------------------------------------------------------------")

N = 10
M = 5000
H = 200
p = 2
B = 20

print(f"|   N   |   M     |   H    |   H/M |")
print(f"-------------------------------------")

for i in range(N):
    M=M+M*p/100
    H=H+B
    print(f"|   {i+1:2}   |   {M:4.2} |   {H}   |   {H/M:.2} |")
    print(f"-------------------------------------------------")

