from math import *

print("▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄")
print("▌                                                 ▐")
print("▌       Задача 1.3. Вариант 17                    ▐")
print("▌                                                 ▐")
print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")

print('''Найти массу заготовки с заданной плотностью материала, имеющей форму прямоугольного
      параллелепипеда с заданной высотой и основаниями, учитывая, что в заготовке параллельно
      высоте просверлено N сквозных отверстий c диаметрами 5, 6, 7, ... , (N+4) см.
      ''')


