from math import *

print("▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄")
print("▌                                                 ▐")
print("▌       Задача 1.4. Вариант 17                    ▐")
print("▌                                                 ▐")
print("▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀")

print('''Найти массу заготовки с заданной плотностью материала, имеющей форму прямоугольного
      параллелепипеда с заданной высотой и основаниями, учитывая, что в заготовке параллельно
      высоте просверлено N сквозных отверстий c диаметрами 5, 6, 7, ... , (N+4) см.
      ''')

ro=1000
pi=3.14265159
diametr=5
a=10
b=20
h=3
N=10

m1=ro * a * b * h
m2=0

for i in range(5,N+4,1):
    m2=m2 + ro * pi * ((diametr / 2) ** 2) * h

print(f"result: {m1-m2}")


